h/Logos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Logos Lab</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-17 Sun"/>
<meta name="author" content="GW Dean"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Logos Lab</h1>

<p>A computational toolkit to help one understand philosophical concepts.
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Logical Diagrams (Carlson-2007) </a>
<ul>
<li><a href="#sec-1.1">1.1 Borromean Knot </a></li>
<li><a href="#sec-1.2">1.2 Game Dynamics </a></li>
<li><a href="#sec-1.3">1.3 Steps and Transitions </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Stepping to Infinity (Carlson-2007.(1-102)) </a>
<ul>
<li><a href="#sec-2.1">2.1 Step 0 Absolute Knowledge </a></li>
<li><a href="#sec-2.2">2.2 Step 1 Becoming </a></li>
<li><a href="#sec-2.3">2.3 Step 2 Something </a></li>
<li><a href="#sec-2.4">2.4 Step 3 Determination of the In-Itself </a></li>
<li><a href="#sec-2.5">2.5 Step 4 Limit (Determinateness as Such) </a></li>
<li><a href="#sec-2.6">2.6 Step 5 The Ought </a></li>
<li><a href="#sec-2.7">2.7 Step 6 Infinity </a></li>
<li><a href="#sec-2.8">2.8 Step 7 True Infinity </a></li>
</ul>
</li>
<li><a href="#sec-3">3 The Concept (Lauer-1982.(57-127)) </a>
<ul>
<li><a href="#sec-3.1">3.1 Overview (57) </a></li>
<li><a href="#sec-3.2">3.2 Philosophical Thinking (59) </a></li>
<li><a href="#sec-3.3">3.3 The "Necessity" of Truth (76) </a></li>
<li><a href="#sec-3.4">3.4 Relation of Thought and Reality (77) </a></li>
<li><a href="#sec-3.5">3.5 The Meaning of Concept (80) </a></li>
<li><a href="#sec-3.6">3.6 Judgment (86) </a></li>
<li><a href="#sec-3.7">3.7 Syllogism (91) </a></li>
<li><a href="#sec-3.8">3.8 From Subjectivity to Objectivity (96) </a></li>
<li><a href="#sec-3.9">3.9 The Meaning of "Objectivity" (101) </a></li>
<li><a href="#sec-3.10">3.10 The Dynamism of Purpose (104) </a></li>
<li><a href="#sec-3.11">3.11 Subject-Object (109) </a></li>
<li><a href="#sec-3.12">3.12 Truth as Idea (113) </a></li>
<li><a href="#sec-3.13">3.13 Idea as Process (117) </a></li>
<li><a href="#sec-3.14">3.14 Idea as Absolute (122) </a></li>
</ul>
</li>
<li><a href="#sec-4">4 God as Spirit (Lauer-1982.(128-161)) </a>
<ul>
<li><a href="#sec-4.1">4.1 Overview (128) </a></li>
<li><a href="#sec-4.2">4.2 Identity of Finite and Infinite Spirit (132) </a></li>
<li><a href="#sec-4.3">4.3 Self-Manifestation Essential to Spirit (137) </a></li>
<li><a href="#sec-4.4">4.4 Activity Without Passivity (141) </a></li>
<li><a href="#sec-4.5">4.5 Only Spirit Knows Spirit (145) </a></li>
<li><a href="#sec-4.6">4.6 Relation of Divine Spirit to the World (149) </a></li>
<li><a href="#sec-4.7">4.7 Human Self-Consciousness Reveals the Divine (154) </a></li>
<li><a href="#sec-4.8">4.8 The Function of Negation (158) </a></li>
</ul>
</li>
<li><a href="#sec-5">5 The Infinite (Lauer-1982.(162-202)) </a>
<ul>
<li><a href="#sec-5.1">5.1 Overview (162) </a></li>
<li><a href="#sec-5.2">5.2 The Infinite Object of Thought (166) </a></li>
<li><a href="#sec-5.3">5.3 The Meaning of "Infinite" (170) </a></li>
<li><a href="#sec-5.4">5.4 Infinity of Concept (174) </a></li>
<li><a href="#sec-5.5">5.5 The Infinity of the Finite (178) </a></li>
<li><a href="#sec-5.6">5.6 Phenomenology of Spirit (183) </a></li>
<li><a href="#sec-5.7">5.7 Philosophy of Religion (189) </a></li>
<li><a href="#sec-5.8">5.8 The Necessary Connection of Thinking and the Reality of God (195) </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Parmenides </a></li>
<li><a href="#sec-7">7 Computational Monadology.(Steinhart.online) </a></li>
<li><a href="#sec-8">8 2/27 of the Science of Logic (Houlgate-2006) </a></li>
<li><a href="#sec-9">9 38 Dialectics in the PhG (Wheat-2012) </a></li>
<li><a href="#sec-10">10 PhG.min </a></li>
<li><a href="#sec-11">11 Resources </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Logical Diagrams (Carlson-2007) </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Borromean Knot </h3>
<div class="outline-text-3" id="text-1.1">

</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Game Dynamics </h3>
<div class="outline-text-3" id="text-1.2">

</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Steps and Transitions </h3>
<div class="outline-text-3" id="text-1.3">

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Stepping to Infinity (Carlson-2007.(1-102)) </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Step 0 Absolute Knowledge </h3>
<div class="outline-text-3" id="text-2.1">

</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Step 1 Becoming </h3>
<div class="outline-text-3" id="text-2.2">

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Step 2 Something </h3>
<div class="outline-text-3" id="text-2.3">

</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Step 3 Determination of the In-Itself </h3>
<div class="outline-text-3" id="text-2.4">

</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> Step 4 Limit (Determinateness as Such) </h3>
<div class="outline-text-3" id="text-2.5">

</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6"><span class="section-number-3">2.6</span> Step 5 The Ought </h3>
<div class="outline-text-3" id="text-2.6">

</div>

</div>

<div id="outline-container-2.7" class="outline-3">
<h3 id="sec-2.7"><span class="section-number-3">2.7</span> Step 6 Infinity </h3>
<div class="outline-text-3" id="text-2.7">

</div>

</div>

<div id="outline-container-2.8" class="outline-3">
<h3 id="sec-2.8"><span class="section-number-3">2.8</span> Step 7 True Infinity </h3>
<div class="outline-text-3" id="text-2.8">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Concept (Lauer-1982.(57-127)) </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Overview (57) </h3>
<div class="outline-text-3" id="text-3.1">

</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> Philosophical Thinking (59) </h3>
<div class="outline-text-3" id="text-3.2">

</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3"><span class="section-number-3">3.3</span> The "Necessity" of Truth (76) </h3>
<div class="outline-text-3" id="text-3.3">

</div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4"><span class="section-number-3">3.4</span> Relation of Thought and Reality (77) </h3>
<div class="outline-text-3" id="text-3.4">

</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5"><span class="section-number-3">3.5</span> The Meaning of Concept (80) </h3>
<div class="outline-text-3" id="text-3.5">

</div>

</div>

<div id="outline-container-3.6" class="outline-3">
<h3 id="sec-3.6"><span class="section-number-3">3.6</span> Judgment (86) </h3>
<div class="outline-text-3" id="text-3.6">

</div>

</div>

<div id="outline-container-3.7" class="outline-3">
<h3 id="sec-3.7"><span class="section-number-3">3.7</span> Syllogism (91) </h3>
<div class="outline-text-3" id="text-3.7">

</div>

</div>

<div id="outline-container-3.8" class="outline-3">
<h3 id="sec-3.8"><span class="section-number-3">3.8</span> From Subjectivity to Objectivity (96) </h3>
<div class="outline-text-3" id="text-3.8">

</div>

</div>

<div id="outline-container-3.9" class="outline-3">
<h3 id="sec-3.9"><span class="section-number-3">3.9</span> The Meaning of "Objectivity" (101) </h3>
<div class="outline-text-3" id="text-3.9">

</div>

</div>

<div id="outline-container-3.10" class="outline-3">
<h3 id="sec-3.10"><span class="section-number-3">3.10</span> The Dynamism of Purpose (104) </h3>
<div class="outline-text-3" id="text-3.10">

</div>

</div>

<div id="outline-container-3.11" class="outline-3">
<h3 id="sec-3.11"><span class="section-number-3">3.11</span> Subject-Object (109) </h3>
<div class="outline-text-3" id="text-3.11">

</div>

</div>

<div id="outline-container-3.12" class="outline-3">
<h3 id="sec-3.12"><span class="section-number-3">3.12</span> Truth as Idea (113) </h3>
<div class="outline-text-3" id="text-3.12">

</div>

</div>

<div id="outline-container-3.13" class="outline-3">
<h3 id="sec-3.13"><span class="section-number-3">3.13</span> Idea as Process (117) </h3>
<div class="outline-text-3" id="text-3.13">

</div>

</div>

<div id="outline-container-3.14" class="outline-3">
<h3 id="sec-3.14"><span class="section-number-3">3.14</span> Idea as Absolute (122) </h3>
<div class="outline-text-3" id="text-3.14">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> God as Spirit (Lauer-1982.(128-161)) </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> Overview (128) </h3>
<div class="outline-text-3" id="text-4.1">

</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2"><span class="section-number-3">4.2</span> Identity of Finite and Infinite Spirit (132) </h3>
<div class="outline-text-3" id="text-4.2">

</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3"><span class="section-number-3">4.3</span> Self-Manifestation Essential to Spirit (137) </h3>
<div class="outline-text-3" id="text-4.3">

</div>

</div>

<div id="outline-container-4.4" class="outline-3">
<h3 id="sec-4.4"><span class="section-number-3">4.4</span> Activity Without Passivity (141) </h3>
<div class="outline-text-3" id="text-4.4">

</div>

</div>

<div id="outline-container-4.5" class="outline-3">
<h3 id="sec-4.5"><span class="section-number-3">4.5</span> Only Spirit Knows Spirit (145) </h3>
<div class="outline-text-3" id="text-4.5">

</div>

</div>

<div id="outline-container-4.6" class="outline-3">
<h3 id="sec-4.6"><span class="section-number-3">4.6</span> Relation of Divine Spirit to the World (149) </h3>
<div class="outline-text-3" id="text-4.6">

</div>

</div>

<div id="outline-container-4.7" class="outline-3">
<h3 id="sec-4.7"><span class="section-number-3">4.7</span> Human Self-Consciousness Reveals the Divine (154) </h3>
<div class="outline-text-3" id="text-4.7">

</div>

</div>

<div id="outline-container-4.8" class="outline-3">
<h3 id="sec-4.8"><span class="section-number-3">4.8</span> The Function of Negation (158) </h3>
<div class="outline-text-3" id="text-4.8">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> The Infinite (Lauer-1982.(162-202)) </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1"><span class="section-number-3">5.1</span> Overview (162) </h3>
<div class="outline-text-3" id="text-5.1">

</div>

</div>

<div id="outline-container-5.2" class="outline-3">
<h3 id="sec-5.2"><span class="section-number-3">5.2</span> The Infinite Object of Thought (166) </h3>
<div class="outline-text-3" id="text-5.2">

</div>

</div>

<div id="outline-container-5.3" class="outline-3">
<h3 id="sec-5.3"><span class="section-number-3">5.3</span> The Meaning of "Infinite" (170) </h3>
<div class="outline-text-3" id="text-5.3">

</div>

</div>

<div id="outline-container-5.4" class="outline-3">
<h3 id="sec-5.4"><span class="section-number-3">5.4</span> Infinity of Concept (174) </h3>
<div class="outline-text-3" id="text-5.4">

</div>

</div>

<div id="outline-container-5.5" class="outline-3">
<h3 id="sec-5.5"><span class="section-number-3">5.5</span> The Infinity of the Finite (178) </h3>
<div class="outline-text-3" id="text-5.5">

</div>

</div>

<div id="outline-container-5.6" class="outline-3">
<h3 id="sec-5.6"><span class="section-number-3">5.6</span> Phenomenology of Spirit (183) </h3>
<div class="outline-text-3" id="text-5.6">

</div>

</div>

<div id="outline-container-5.7" class="outline-3">
<h3 id="sec-5.7"><span class="section-number-3">5.7</span> Philosophy of Religion (189) </h3>
<div class="outline-text-3" id="text-5.7">

</div>

</div>

<div id="outline-container-5.8" class="outline-3">
<h3 id="sec-5.8"><span class="section-number-3">5.8</span> The Necessary Connection of Thinking and the Reality of God (195) </h3>
<div class="outline-text-3" id="text-5.8">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Parmenides </h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Computational Monadology.(Steinhart.online) </h2>
<div class="outline-text-2" id="text-7">

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 2/27 of the Science of Logic (Houlgate-2006) </h2>
<div class="outline-text-2" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 38 Dialectics in the PhG (Wheat-2012) </h2>
<div class="outline-text-2" id="text-9">

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> PhG.min </h2>
<div class="outline-text-2" id="text-10">

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Resources </h2>
<div class="outline-text-2" id="text-11">

<ul>
<li>
Carlson-2007
</li>
<li>
Lauer-1982
</li>
<li>
Kontopoulos-1979
</li>
<li>
Houlgate-2006
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: GW Dean
<a href="mailto:gwdean@gmail.com">&lt;gwdean@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-11-17 Sun</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
